Ok, the CSI is working again. Thank you. But I still stuck with my agent-3 node: 

1. I tried to shutdown and restart the node
2. I tried to reapply Terraform when node-3 (see: "Logs when node running")
3. I tried to reapply Terraform after node-3 was deleted (see: "Logs when node was deleted")


Logs when node running
```bash
❯ tf apply --auto-approve
random_password.k3s_token: Refreshing state... [id=none]
local_file.traefik_config: Refreshing state... [id=25ba84696ee16d68f5b98f6ea6b70bb14c3c530c]
hcloud_network.k3s: Refreshing state... [id=1352333]
hcloud_placement_group.k3s_placement_group: Refreshing state... [id=19653]
hcloud_ssh_key.default: Refreshing state... [id=5492430]
hcloud_firewall.k3s: Refreshing state... [id=290151]
local_file.hetzner_ccm_config: Refreshing state... [id=f5ec6cb5689cb5830d04857365d567edae562174]
hcloud_network_subnet.k3s: Refreshing state... [id=1352333-10.0.0.0/16]
local_file.hetzner_csi_config: Refreshing state... [id=17eb99cc9c025b24af1e1f591d01ec110dc91dc1]
hcloud_server.first_control_plane: Refreshing state... [id=17736249]
hcloud_server.control_planes[1]: Refreshing state... [id=17736378]
hcloud_server.control_planes[0]: Refreshing state... [id=17736377]
hcloud_server.agents[4]: Refreshing state... [id=17858945]
hcloud_server.agents[2]: Refreshing state... [id=17736383]
hcloud_server.agents[5]: Refreshing state... [id=17861319]
hcloud_server.agents[3]: Refreshing state... [id=17872069]
hcloud_server.agents[0]: Refreshing state... [id=17736379]
hcloud_server.agents[1]: Refreshing state... [id=17736385]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the last "terraform apply":

  # hcloud_firewall.k3s has been changed
  ~ resource "hcloud_firewall" "k3s" {
        id     = "290151"
        name   = "k3s-firewall"
        # (1 unchanged attribute hidden)

      - apply_to {
          - server = 17870378 -> null
        }
      + apply_to {
          + server = 17872069
        }

        # (21 unchanged blocks hidden)
    }
  # hcloud_placement_group.k3s_placement_group has been changed
  ~ resource "hcloud_placement_group" "k3s_placement_group" {
        id      = "19653"
        name    = "k3s-placement-group"
      ~ servers = [
          - 17870378,
          + 17872069,
            # (8 unchanged elements hidden)
        ]
        # (2 unchanged attributes hidden)
    }
  # hcloud_server.agents[3] has been changed
  ~ resource "hcloud_server" "agents" {
      + datacenter         = "fsn1-dc14"
        id                 = "17872069"
      + ipv4_address       = "78.47.82.xxx"
      + ipv6_address       = "2a01:4f8:c17:xxxx::1"
      + ipv6_network       = "2a01:4f8:c17:xxxx::/64"
        name               = "k3s-agent-3"
      + status             = "running"
        # (12 unchanged attributes hidden)

      + network {
          + alias_ips   = []
          + ip          = "10.0.0.11"
          + mac_address = "86:00:00:03:9b:35"
          + network_id  = 1352333
        }
      - network {
          - alias_ips  = [] -> null
          - ip         = "10.0.0.8" -> null
          - network_id = 1352333 -> null
        }
    }
  # local_file.hetzner_csi_config has been deleted
  - resource "local_file" "hetzner_csi_config" {
      - content              = <<-EOT
            apiVersion: kustomize.config.k8s.io/v1beta1
            kind: Kustomization

            resources:
            - "https://raw.githubusercontent.com/hetznercloud/csi-driver/v1.6.0/deploy/kubernetes/hcloud-csi.yml"


            patchesStrategicMerge:
            - patch_latest.yaml
        EOT -> null
      - directory_permission = "0755" -> null
      - file_permission      = "0644" -> null
      - filename             = "./hetzner/csi/kustomization.yaml" -> null
      - id                   = "17eb99cc9c025b24af1e1f591d01ec110dc91dc1" -> null
    }

Unless you have made equivalent changes to your configuration, or ignored the relevant attributes using ignore_changes, the following plan may include actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # hcloud_server.agents[3] is tainted, so must be replaced
-/+ resource "hcloud_server" "agents" {
      + backup_window      = (known after apply)
      ~ datacenter         = "fsn1-dc14" -> (known after apply)
      ~ id                 = "17872069" -> (known after apply)
      ~ ipv4_address       = "78.47.82.xxx" -> (known after apply)
      ~ ipv6_address       = "2a01:4f8:c17:xxxx::1" -> (known after apply)
      ~ ipv6_network       = "2a01:4f8:c17:xxxx::/64" -> (known after apply)
        name               = "k3s-agent-3"
      ~ status             = "running" -> (known after apply)
        # (12 unchanged attributes hidden)

      - network {
          - alias_ips   = [] -> null
          - ip          = "10.0.0.11" -> null
          - mac_address = "86:00:00:03:9b:35" -> null
          - network_id  = 1352333 -> null
        }
      + network {
          + alias_ips   = []
          + ip          = "10.0.0.8"
          + mac_address = (known after apply)
          + network_id  = 1352333
        }
    }

  # local_file.hetzner_csi_config will be created
  + resource "local_file" "hetzner_csi_config" {
      + content              = <<-EOT
            apiVersion: kustomize.config.k8s.io/v1beta1
            kind: Kustomization

            resources:
            - "https://raw.githubusercontent.com/hetznercloud/csi-driver/v1.6.0/deploy/kubernetes/hcloud-csi.yml"

        EOT
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "./hetzner/csi/kustomization.yaml"
      + id                   = (known after apply)
    }

Plan: 2 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  ~ agents_public_ip = [
        # (2 unchanged elements hidden)
        "138.201.246.186",
      + (known after apply),
      + "78.46.163.xxx",
      + "49.12.100.xxx",
    ]
hcloud_server.agents[3]: Destroying... [id=17872069]
hcloud_server.agents[3]: Destruction complete after 1s
local_file.hetzner_csi_config: Creating...
hcloud_server.agents[3]: Creating...
local_file.hetzner_csi_config: Creation complete after 0s [id=aa232912bcf86722e32b698e1e077522c7f02a9d]
hcloud_server.agents[3]: Still creating... [10s elapsed]
╷
│ Error: hcloud/inlineAttachServerToNetwork: attach server to network: provided IP is not available (ip_not_available)
│
│   with hcloud_server.agents[3],
│   on agents.tf line 1, in resource "hcloud_server" "agents":
│    1: resource "hcloud_server" "agents" {
│
╵

```


Logs when node deleted
```bash
❯ tf apply --auto-approve
random_password.k3s_token: Refreshing state... [id=none]
hcloud_network.k3s: Refreshing state... [id=1352333]
hcloud_ssh_key.default: Refreshing state... [id=5492430]
hcloud_placement_group.k3s_placement_group: Refreshing state... [id=19653]
local_file.traefik_config: Refreshing state... [id=25ba84696ee16d68f5b98f6ea6b70bb14c3c530c]
hcloud_firewall.k3s: Refreshing state... [id=290151]
local_file.hetzner_csi_config: Refreshing state... [id=aa232912bcf86722e32b698e1e077522c7f02a9d]
local_file.hetzner_ccm_config: Refreshing state... [id=f5ec6cb5689cb5830d04857365d567edae562174]
hcloud_network_subnet.k3s: Refreshing state... [id=1352333-10.0.0.0/16]
hcloud_server.first_control_plane: Refreshing state... [id=17736249]
hcloud_server.agents[5]: Refreshing state... [id=17861319]
hcloud_server.agents[2]: Refreshing state... [id=17736383]
hcloud_server.agents[0]: Refreshing state... [id=17736379]
hcloud_server.agents[3]: Refreshing state... [id=17875783]
hcloud_server.agents[1]: Refreshing state... [id=17736385]
hcloud_server.control_planes[0]: Refreshing state... [id=17736377]
hcloud_server.agents[4]: Refreshing state... [id=17858945]
hcloud_server.control_planes[1]: Refreshing state... [id=17736378]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the last "terraform apply":

  # hcloud_placement_group.k3s_placement_group has been changed
  ~ resource "hcloud_placement_group" "k3s_placement_group" {
        id      = "19653"
        name    = "k3s-placement-group"
      ~ servers = [
          - 17872069,
            # (8 unchanged elements hidden)
        ]
        # (2 unchanged attributes hidden)
    }
  # hcloud_firewall.k3s has been changed
  ~ resource "hcloud_firewall" "k3s" {
        id     = "290151"
        name   = "k3s-firewall"
        # (1 unchanged attribute hidden)

      - apply_to {
          - server = 17872069 -> null
        }

        # (21 unchanged blocks hidden)
    }
  # hcloud_server.agents[3] has been deleted
  - resource "hcloud_server" "agents" {
      - backups            = false -> null
      - delete_protection  = false -> null
      - firewall_ids       = [
          - 290151,
        ] -> null
      - id                 = "17875783" -> null
      - image              = "ubuntu-20.04" -> null
      - keep_disk          = false -> null
      - labels             = {
          - "engine"      = "k3s"
          - "k3s_upgrade" = "true"
          - "provisioner" = "terraform"
        } -> null
      - location           = "fsn1" -> null
      - name               = "k3s-agent-3" -> null
      - placement_group_id = 19653 -> null
      - rebuild_protection = false -> null
      - rescue             = "linux64" -> null
      - server_type        = "cpx21" -> null
      - ssh_keys           = [
          - "5492430",
        ] -> null

      - network {
          - alias_ips  = [] -> null
          - ip         = "10.0.0.8" -> null
          - network_id = 1352333 -> null
        }
    }

Unless you have made equivalent changes to your configuration, or ignored the relevant attributes using ignore_changes, the following plan may include actions to undo or respond to these changes.

───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # hcloud_server.agents[3] will be created
  + resource "hcloud_server" "agents" {
      + backup_window      = (known after apply)
      + backups            = false
      + datacenter         = (known after apply)
      + delete_protection  = false
      + firewall_ids       = [
          + 290151,
        ]
      + id                 = (known after apply)
      + image              = "ubuntu-20.04"
      + ipv4_address       = (known after apply)
      + ipv6_address       = (known after apply)
      + ipv6_network       = (known after apply)
      + keep_disk          = false
      + labels             = {
          + "engine"      = "k3s"
          + "k3s_upgrade" = "true"
          + "provisioner" = "terraform"
        }
      + location           = "fsn1"
      + name               = "k3s-agent-3"
      + placement_group_id = 19653
      + rebuild_protection = false
      + rescue             = "linux64"
      + server_type        = "cpx21"
      + ssh_keys           = [
          + "5492430",
        ]
      + status             = (known after apply)

      + network {
          + alias_ips   = []
          + ip          = "10.0.0.8"
          + mac_address = (known after apply)
          + network_id  = 1352333
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ agents_public_ip = [
        # (2 unchanged elements hidden)
        "138.201.246.xxx",
      + (known after apply),
      + "78.46.163.xxx",
      + "49.12.100.xxx",
    ]
hcloud_server.agents[3]: Creating...
hcloud_server.agents[3]: Still creating... [10s elapsed]
╷
│ Error: hcloud/inlineAttachServerToNetwork: attach server to network: provided IP is not available (ip_not_available)
│
│   with hcloud_server.agents[3],
│   on agents.tf line 1, in resource "hcloud_server" "agents":
│    1: resource "hcloud_server" "agents" {
│
╵
```